Benjamin-girard-1/geophys_acquisition_module/version_2/firmware/sdkconfig.defaults
# Target: ESP32-S3-DevKitC-1-N8R8 / ESP32-S3-WROOM-1-N8R8
CONFIG_IDF_TARGET="esp32s3"

# 8 MB Quad SPI flash
# CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 8 MB Octal SPI PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=y
# CONFIG_SPIRAM_IGNORE_NOTFOUND is not set

# Keep peripheral clocks fixed during milestone-1 acquisition and UART streaming.
# CONFIG_PM_ENABLE is not set
